/* automatically generated by rust-bindgen 0.71.1 */

pub unsafe fn x264_encoder_open(params: *mut x264_param_t) -> *mut x264_t {
                               x264_encoder_open_164(params)
                          }

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;

pub const X264_CSP_NV12: u32 = 4;
pub const X264_CSP_NV21: u32 = 5;
pub const X264_CSP_I422: u32 = 6;
pub const X264_CSP_YV16: u32 = 7;
pub const X264_CSP_NV16: u32 = 8;
pub const X264_CSP_YUYV: u32 = 9;
pub const X264_CSP_UYVY: u32 = 10;
pub const X264_CSP_V210: u32 = 11;
pub const X264_CSP_I444: u32 = 12;
pub const X264_CSP_YV24: u32 = 13;
pub const X264_CSP_BGR: u32 = 14;
pub const X264_CSP_BGRA: u32 = 15;
pub const X264_CSP_RGB: u32 = 16;
pub const X264_CSP_MAX: u32 = 17;
pub const X264_CSP_VFLIP: u32 = 4096;
pub const X264_CSP_HIGH_DEPTH: u32 = 8192;
pub const X264_TYPE_AUTO: u32 = 0;
pub const X264_TYPE_IDR: u32 = 1;
pub const X264_TYPE_I: u32 = 2;
pub const X264_TYPE_P: u32 = 3;
pub const X264_TYPE_BREF: u32 = 4;
pub const X264_TYPE_B: u32 = 5;
pub const X264_TYPE_KEYFRAME: u32 = 6;
pub const X264_LOG_NONE: i32 = -1;
pub const X264_LOG_ERROR: u32 = 0;
pub const X264_LOG_WARNING: u32 = 1;
pub const X264_LOG_INFO: u32 = 2;
pub const X264_LOG_DEBUG: u32 = 3;
pub const X264_THREADS_AUTO: u32 = 0;
pub const X264_SYNC_LOOKAHEAD_AUTO: i32 = -1;
pub const X264_NAL_HRD_NONE: u32 = 0;
pub const X264_NAL_HRD_VBR: u32 = 1;
pub const X264_NAL_HRD_CBR: u32 = 2;
pub const X264_PARAM_BAD_NAME: i32 = -1;
pub const X264_PARAM_BAD_VALUE: i32 = -2;
pub const X264_PARAM_ALLOC_FAILED: i32 = -3;
pub const X264_MBINFO_CONSTANT: u32 = 1;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_t {
    _unused: [u8; 0],
}
pub const nal_unit_type_e_NAL_UNKNOWN: nal_unit_type_e = 0;
pub const nal_unit_type_e_NAL_SLICE: nal_unit_type_e = 1;
pub const nal_unit_type_e_NAL_SLICE_DPA: nal_unit_type_e = 2;
pub const nal_unit_type_e_NAL_SLICE_DPB: nal_unit_type_e = 3;
pub const nal_unit_type_e_NAL_SLICE_DPC: nal_unit_type_e = 4;
pub const nal_unit_type_e_NAL_SLICE_IDR: nal_unit_type_e = 5;
pub const nal_unit_type_e_NAL_SEI: nal_unit_type_e = 6;
pub const nal_unit_type_e_NAL_SPS: nal_unit_type_e = 7;
pub const nal_unit_type_e_NAL_PPS: nal_unit_type_e = 8;
pub const nal_unit_type_e_NAL_AUD: nal_unit_type_e = 9;
pub const nal_unit_type_e_NAL_FILLER: nal_unit_type_e = 12;
#[doc = " NAL structure and functions"]
pub type nal_unit_type_e = ::std::os::raw::c_uint;
pub const nal_priority_e_NAL_PRIORITY_DISPOSABLE: nal_priority_e = 0;
pub const nal_priority_e_NAL_PRIORITY_LOW: nal_priority_e = 1;
pub const nal_priority_e_NAL_PRIORITY_HIGH: nal_priority_e = 2;
pub const nal_priority_e_NAL_PRIORITY_HIGHEST: nal_priority_e = 3;
pub type nal_priority_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_nal_t {
    pub i_ref_idc: ::std::os::raw::c_int,
    pub i_type: ::std::os::raw::c_int,
    pub b_long_startcode: ::std::os::raw::c_int,
    pub i_first_mb: ::std::os::raw::c_int,
    pub i_last_mb: ::std::os::raw::c_int,
    pub i_payload: ::std::os::raw::c_int,
    pub p_payload: *mut u8,
    pub i_padding: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_nal_t"][::std::mem::size_of::<x264_nal_t>() - 40usize];
    ["Alignment of x264_nal_t"][::std::mem::align_of::<x264_nal_t>() - 8usize];
    ["Offset of field: x264_nal_t::i_ref_idc"]
        [::std::mem::offset_of!(x264_nal_t, i_ref_idc) - 0usize];
    ["Offset of field: x264_nal_t::i_type"][::std::mem::offset_of!(x264_nal_t, i_type) - 4usize];
    ["Offset of field: x264_nal_t::b_long_startcode"]
        [::std::mem::offset_of!(x264_nal_t, b_long_startcode) - 8usize];
    ["Offset of field: x264_nal_t::i_first_mb"]
        [::std::mem::offset_of!(x264_nal_t, i_first_mb) - 12usize];
    ["Offset of field: x264_nal_t::i_last_mb"]
        [::std::mem::offset_of!(x264_nal_t, i_last_mb) - 16usize];
    ["Offset of field: x264_nal_t::i_payload"]
        [::std::mem::offset_of!(x264_nal_t, i_payload) - 20usize];
    ["Offset of field: x264_nal_t::p_payload"]
        [::std::mem::offset_of!(x264_nal_t, p_payload) - 24usize];
    ["Offset of field: x264_nal_t::i_padding"]
        [::std::mem::offset_of!(x264_nal_t, i_padding) - 32usize];
};
unsafe extern "C" {
    pub static x264_direct_pred_names: [*const ::std::os::raw::c_char; 5usize];
}
unsafe extern "C" {
    pub static x264_motion_est_names: [*const ::std::os::raw::c_char; 6usize];
}
unsafe extern "C" {
    pub static x264_b_pyramid_names: [*const ::std::os::raw::c_char; 4usize];
}
unsafe extern "C" {
    pub static x264_overscan_names: [*const ::std::os::raw::c_char; 4usize];
}
unsafe extern "C" {
    pub static x264_vidformat_names: [*const ::std::os::raw::c_char; 7usize];
}
unsafe extern "C" {
    pub static x264_fullrange_names: [*const ::std::os::raw::c_char; 3usize];
}
unsafe extern "C" {
    pub static x264_colorprim_names: [*const ::std::os::raw::c_char; 14usize];
}
unsafe extern "C" {
    pub static x264_transfer_names: [*const ::std::os::raw::c_char; 20usize];
}
unsafe extern "C" {
    pub static x264_colmatrix_names: [*const ::std::os::raw::c_char; 16usize];
}
unsafe extern "C" {
    pub static x264_nal_hrd_names: [*const ::std::os::raw::c_char; 4usize];
}
unsafe extern "C" {
    pub static x264_avcintra_flavor_names: [*const ::std::os::raw::c_char; 3usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_zone_t {
    pub i_start: ::std::os::raw::c_int,
    pub i_end: ::std::os::raw::c_int,
    pub b_force_qp: ::std::os::raw::c_int,
    pub i_qp: ::std::os::raw::c_int,
    pub f_bitrate_factor: f32,
    pub param: *mut x264_param_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_zone_t"][::std::mem::size_of::<x264_zone_t>() - 32usize];
    ["Alignment of x264_zone_t"][::std::mem::align_of::<x264_zone_t>() - 8usize];
    ["Offset of field: x264_zone_t::i_start"]
        [::std::mem::offset_of!(x264_zone_t, i_start) - 0usize];
    ["Offset of field: x264_zone_t::i_end"][::std::mem::offset_of!(x264_zone_t, i_end) - 4usize];
    ["Offset of field: x264_zone_t::b_force_qp"]
        [::std::mem::offset_of!(x264_zone_t, b_force_qp) - 8usize];
    ["Offset of field: x264_zone_t::i_qp"][::std::mem::offset_of!(x264_zone_t, i_qp) - 12usize];
    ["Offset of field: x264_zone_t::f_bitrate_factor"]
        [::std::mem::offset_of!(x264_zone_t, f_bitrate_factor) - 16usize];
    ["Offset of field: x264_zone_t::param"][::std::mem::offset_of!(x264_zone_t, param) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_param_t {
    pub cpu: u32,
    pub i_threads: ::std::os::raw::c_int,
    pub i_lookahead_threads: ::std::os::raw::c_int,
    pub b_sliced_threads: ::std::os::raw::c_int,
    pub b_deterministic: ::std::os::raw::c_int,
    pub b_cpu_independent: ::std::os::raw::c_int,
    pub i_sync_lookahead: ::std::os::raw::c_int,
    pub i_width: ::std::os::raw::c_int,
    pub i_height: ::std::os::raw::c_int,
    pub i_csp: ::std::os::raw::c_int,
    pub i_bitdepth: ::std::os::raw::c_int,
    pub i_level_idc: ::std::os::raw::c_int,
    pub i_frame_total: ::std::os::raw::c_int,
    pub i_nal_hrd: ::std::os::raw::c_int,
    pub vui: x264_param_t__bindgen_ty_1,
    pub i_frame_reference: ::std::os::raw::c_int,
    pub i_dpb_size: ::std::os::raw::c_int,
    pub i_keyint_max: ::std::os::raw::c_int,
    pub i_keyint_min: ::std::os::raw::c_int,
    pub i_scenecut_threshold: ::std::os::raw::c_int,
    pub b_intra_refresh: ::std::os::raw::c_int,
    pub i_bframe: ::std::os::raw::c_int,
    pub i_bframe_adaptive: ::std::os::raw::c_int,
    pub i_bframe_bias: ::std::os::raw::c_int,
    pub i_bframe_pyramid: ::std::os::raw::c_int,
    pub b_open_gop: ::std::os::raw::c_int,
    pub b_bluray_compat: ::std::os::raw::c_int,
    pub i_avcintra_class: ::std::os::raw::c_int,
    pub i_avcintra_flavor: ::std::os::raw::c_int,
    pub b_deblocking_filter: ::std::os::raw::c_int,
    pub i_deblocking_filter_alphac0: ::std::os::raw::c_int,
    pub i_deblocking_filter_beta: ::std::os::raw::c_int,
    pub b_cabac: ::std::os::raw::c_int,
    pub i_cabac_init_idc: ::std::os::raw::c_int,
    pub b_interlaced: ::std::os::raw::c_int,
    pub b_constrained_intra: ::std::os::raw::c_int,
    pub i_cqm_preset: ::std::os::raw::c_int,
    pub psz_cqm_file: *mut ::std::os::raw::c_char,
    pub cqm_4iy: [u8; 16usize],
    pub cqm_4py: [u8; 16usize],
    pub cqm_4ic: [u8; 16usize],
    pub cqm_4pc: [u8; 16usize],
    pub cqm_8iy: [u8; 64usize],
    pub cqm_8py: [u8; 64usize],
    pub cqm_8ic: [u8; 64usize],
    pub cqm_8pc: [u8; 64usize],
    pub pf_log: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            i_level: ::std::os::raw::c_int,
            psz: *const ::std::os::raw::c_char,
            arg2: *mut __va_list_tag,
        ),
    >,
    pub p_log_private: *mut ::std::os::raw::c_void,
    pub i_log_level: ::std::os::raw::c_int,
    pub b_full_recon: ::std::os::raw::c_int,
    pub psz_dump_yuv: *mut ::std::os::raw::c_char,
    pub analyse: x264_param_t__bindgen_ty_2,
    pub rc: x264_param_t__bindgen_ty_3,
    pub crop_rect: x264_param_t__bindgen_ty_4,
    pub i_frame_packing: ::std::os::raw::c_int,
    pub mastering_display: x264_param_t__bindgen_ty_5,
    pub content_light_level: x264_param_t__bindgen_ty_6,
    pub i_alternative_transfer: ::std::os::raw::c_int,
    pub b_aud: ::std::os::raw::c_int,
    pub b_repeat_headers: ::std::os::raw::c_int,
    pub b_annexb: ::std::os::raw::c_int,
    pub i_sps_id: ::std::os::raw::c_int,
    pub b_vfr_input: ::std::os::raw::c_int,
    pub b_pulldown: ::std::os::raw::c_int,
    pub i_fps_num: u32,
    pub i_fps_den: u32,
    pub i_timebase_num: u32,
    pub i_timebase_den: u32,
    pub b_tff: ::std::os::raw::c_int,
    pub b_pic_struct: ::std::os::raw::c_int,
    pub b_fake_interlaced: ::std::os::raw::c_int,
    pub b_stitchable: ::std::os::raw::c_int,
    pub b_opencl: ::std::os::raw::c_int,
    pub i_opencl_device: ::std::os::raw::c_int,
    pub opencl_device_id: *mut ::std::os::raw::c_void,
    pub psz_clbin_file: *mut ::std::os::raw::c_char,
    pub i_slice_max_size: ::std::os::raw::c_int,
    pub i_slice_max_mbs: ::std::os::raw::c_int,
    pub i_slice_min_mbs: ::std::os::raw::c_int,
    pub i_slice_count: ::std::os::raw::c_int,
    pub i_slice_count_max: ::std::os::raw::c_int,
    pub param_free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub nalu_process: ::std::option::Option<
        unsafe extern "C" fn(
            h: *mut x264_t,
            nal: *mut x264_nal_t,
            opaque: *mut ::std::os::raw::c_void,
        ),
    >,
    pub opaque: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_param_t__bindgen_ty_1 {
    pub i_sar_height: ::std::os::raw::c_int,
    pub i_sar_width: ::std::os::raw::c_int,
    pub i_overscan: ::std::os::raw::c_int,
    pub i_vidformat: ::std::os::raw::c_int,
    pub b_fullrange: ::std::os::raw::c_int,
    pub i_colorprim: ::std::os::raw::c_int,
    pub i_transfer: ::std::os::raw::c_int,
    pub i_colmatrix: ::std::os::raw::c_int,
    pub i_chroma_loc: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_param_t__bindgen_ty_1"]
        [::std::mem::size_of::<x264_param_t__bindgen_ty_1>() - 36usize];
    ["Alignment of x264_param_t__bindgen_ty_1"]
        [::std::mem::align_of::<x264_param_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::i_sar_height"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, i_sar_height) - 0usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::i_sar_width"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, i_sar_width) - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::i_overscan"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, i_overscan) - 8usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::i_vidformat"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, i_vidformat) - 12usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::b_fullrange"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, b_fullrange) - 16usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::i_colorprim"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, i_colorprim) - 20usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::i_transfer"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, i_transfer) - 24usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::i_colmatrix"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, i_colmatrix) - 28usize];
    ["Offset of field: x264_param_t__bindgen_ty_1::i_chroma_loc"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_1, i_chroma_loc) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_param_t__bindgen_ty_2 {
    pub intra: ::std::os::raw::c_uint,
    pub inter: ::std::os::raw::c_uint,
    pub b_transform_8x8: ::std::os::raw::c_int,
    pub i_weighted_pred: ::std::os::raw::c_int,
    pub b_weighted_bipred: ::std::os::raw::c_int,
    pub i_direct_mv_pred: ::std::os::raw::c_int,
    pub i_chroma_qp_offset: ::std::os::raw::c_int,
    pub i_me_method: ::std::os::raw::c_int,
    pub i_me_range: ::std::os::raw::c_int,
    pub i_mv_range: ::std::os::raw::c_int,
    pub i_mv_range_thread: ::std::os::raw::c_int,
    pub i_subpel_refine: ::std::os::raw::c_int,
    pub b_chroma_me: ::std::os::raw::c_int,
    pub b_mixed_references: ::std::os::raw::c_int,
    pub i_trellis: ::std::os::raw::c_int,
    pub b_fast_pskip: ::std::os::raw::c_int,
    pub b_dct_decimate: ::std::os::raw::c_int,
    pub i_noise_reduction: ::std::os::raw::c_int,
    pub f_psy_rd: f32,
    pub f_psy_trellis: f32,
    pub b_psy: ::std::os::raw::c_int,
    pub b_mb_info: ::std::os::raw::c_int,
    pub b_mb_info_update: ::std::os::raw::c_int,
    pub i_luma_deadzone: [::std::os::raw::c_int; 2usize],
    pub b_psnr: ::std::os::raw::c_int,
    pub b_ssim: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_param_t__bindgen_ty_2"]
        [::std::mem::size_of::<x264_param_t__bindgen_ty_2>() - 108usize];
    ["Alignment of x264_param_t__bindgen_ty_2"]
        [::std::mem::align_of::<x264_param_t__bindgen_ty_2>() - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::intra"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, intra) - 0usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::inter"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, inter) - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_transform_8x8"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_transform_8x8) - 8usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_weighted_pred"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_weighted_pred) - 12usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_weighted_bipred"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_weighted_bipred) - 16usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_direct_mv_pred"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_direct_mv_pred) - 20usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_chroma_qp_offset"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_chroma_qp_offset) - 24usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_me_method"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_me_method) - 28usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_me_range"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_me_range) - 32usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_mv_range"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_mv_range) - 36usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_mv_range_thread"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_mv_range_thread) - 40usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_subpel_refine"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_subpel_refine) - 44usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_chroma_me"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_chroma_me) - 48usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_mixed_references"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_mixed_references) - 52usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_trellis"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_trellis) - 56usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_fast_pskip"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_fast_pskip) - 60usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_dct_decimate"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_dct_decimate) - 64usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_noise_reduction"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_noise_reduction) - 68usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::f_psy_rd"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, f_psy_rd) - 72usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::f_psy_trellis"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, f_psy_trellis) - 76usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_psy"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_psy) - 80usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_mb_info"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_mb_info) - 84usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_mb_info_update"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_mb_info_update) - 88usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::i_luma_deadzone"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, i_luma_deadzone) - 92usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_psnr"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_psnr) - 100usize];
    ["Offset of field: x264_param_t__bindgen_ty_2::b_ssim"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_2, b_ssim) - 104usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_param_t__bindgen_ty_3 {
    pub i_rc_method: ::std::os::raw::c_int,
    pub i_qp_constant: ::std::os::raw::c_int,
    pub i_qp_min: ::std::os::raw::c_int,
    pub i_qp_max: ::std::os::raw::c_int,
    pub i_qp_step: ::std::os::raw::c_int,
    pub i_bitrate: ::std::os::raw::c_int,
    pub f_rf_constant: f32,
    pub f_rf_constant_max: f32,
    pub f_rate_tolerance: f32,
    pub i_vbv_max_bitrate: ::std::os::raw::c_int,
    pub i_vbv_buffer_size: ::std::os::raw::c_int,
    pub f_vbv_buffer_init: f32,
    pub f_ip_factor: f32,
    pub f_pb_factor: f32,
    pub b_filler: ::std::os::raw::c_int,
    pub i_aq_mode: ::std::os::raw::c_int,
    pub f_aq_strength: f32,
    pub b_mb_tree: ::std::os::raw::c_int,
    pub i_lookahead: ::std::os::raw::c_int,
    pub b_stat_write: ::std::os::raw::c_int,
    pub psz_stat_out: *mut ::std::os::raw::c_char,
    pub b_stat_read: ::std::os::raw::c_int,
    pub psz_stat_in: *mut ::std::os::raw::c_char,
    pub f_qcompress: f32,
    pub f_qblur: f32,
    pub f_complexity_blur: f32,
    pub zones: *mut x264_zone_t,
    pub i_zones: ::std::os::raw::c_int,
    pub psz_zones: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_param_t__bindgen_ty_3"]
        [::std::mem::size_of::<x264_param_t__bindgen_ty_3>() - 144usize];
    ["Alignment of x264_param_t__bindgen_ty_3"]
        [::std::mem::align_of::<x264_param_t__bindgen_ty_3>() - 8usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_rc_method"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_rc_method) - 0usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_qp_constant"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_qp_constant) - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_qp_min"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_qp_min) - 8usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_qp_max"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_qp_max) - 12usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_qp_step"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_qp_step) - 16usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_bitrate"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_bitrate) - 20usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_rf_constant"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_rf_constant) - 24usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_rf_constant_max"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_rf_constant_max) - 28usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_rate_tolerance"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_rate_tolerance) - 32usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_vbv_max_bitrate"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_vbv_max_bitrate) - 36usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_vbv_buffer_size"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_vbv_buffer_size) - 40usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_vbv_buffer_init"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_vbv_buffer_init) - 44usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_ip_factor"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_ip_factor) - 48usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_pb_factor"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_pb_factor) - 52usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::b_filler"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, b_filler) - 56usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_aq_mode"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_aq_mode) - 60usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_aq_strength"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_aq_strength) - 64usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::b_mb_tree"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, b_mb_tree) - 68usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_lookahead"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_lookahead) - 72usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::b_stat_write"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, b_stat_write) - 76usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::psz_stat_out"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, psz_stat_out) - 80usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::b_stat_read"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, b_stat_read) - 88usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::psz_stat_in"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, psz_stat_in) - 96usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_qcompress"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_qcompress) - 104usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_qblur"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_qblur) - 108usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::f_complexity_blur"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, f_complexity_blur) - 112usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::zones"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, zones) - 120usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::i_zones"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, i_zones) - 128usize];
    ["Offset of field: x264_param_t__bindgen_ty_3::psz_zones"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_3, psz_zones) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_param_t__bindgen_ty_4 {
    pub i_left: ::std::os::raw::c_int,
    pub i_top: ::std::os::raw::c_int,
    pub i_right: ::std::os::raw::c_int,
    pub i_bottom: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_param_t__bindgen_ty_4"]
        [::std::mem::size_of::<x264_param_t__bindgen_ty_4>() - 16usize];
    ["Alignment of x264_param_t__bindgen_ty_4"]
        [::std::mem::align_of::<x264_param_t__bindgen_ty_4>() - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_4::i_left"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_4, i_left) - 0usize];
    ["Offset of field: x264_param_t__bindgen_ty_4::i_top"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_4, i_top) - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_4::i_right"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_4, i_right) - 8usize];
    ["Offset of field: x264_param_t__bindgen_ty_4::i_bottom"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_4, i_bottom) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_param_t__bindgen_ty_5 {
    pub b_mastering_display: ::std::os::raw::c_int,
    pub i_green_x: ::std::os::raw::c_int,
    pub i_green_y: ::std::os::raw::c_int,
    pub i_blue_x: ::std::os::raw::c_int,
    pub i_blue_y: ::std::os::raw::c_int,
    pub i_red_x: ::std::os::raw::c_int,
    pub i_red_y: ::std::os::raw::c_int,
    pub i_white_x: ::std::os::raw::c_int,
    pub i_white_y: ::std::os::raw::c_int,
    pub i_display_max: i64,
    pub i_display_min: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_param_t__bindgen_ty_5"]
        [::std::mem::size_of::<x264_param_t__bindgen_ty_5>() - 56usize];
    ["Alignment of x264_param_t__bindgen_ty_5"]
        [::std::mem::align_of::<x264_param_t__bindgen_ty_5>() - 8usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::b_mastering_display"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, b_mastering_display) - 0usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_green_x"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_green_x) - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_green_y"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_green_y) - 8usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_blue_x"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_blue_x) - 12usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_blue_y"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_blue_y) - 16usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_red_x"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_red_x) - 20usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_red_y"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_red_y) - 24usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_white_x"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_white_x) - 28usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_white_y"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_white_y) - 32usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_display_max"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_display_max) - 40usize];
    ["Offset of field: x264_param_t__bindgen_ty_5::i_display_min"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_5, i_display_min) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_param_t__bindgen_ty_6 {
    pub b_cll: ::std::os::raw::c_int,
    pub i_max_cll: ::std::os::raw::c_int,
    pub i_max_fall: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_param_t__bindgen_ty_6"]
        [::std::mem::size_of::<x264_param_t__bindgen_ty_6>() - 12usize];
    ["Alignment of x264_param_t__bindgen_ty_6"]
        [::std::mem::align_of::<x264_param_t__bindgen_ty_6>() - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_6::b_cll"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_6, b_cll) - 0usize];
    ["Offset of field: x264_param_t__bindgen_ty_6::i_max_cll"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_6, i_max_cll) - 4usize];
    ["Offset of field: x264_param_t__bindgen_ty_6::i_max_fall"]
        [::std::mem::offset_of!(x264_param_t__bindgen_ty_6, i_max_fall) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_param_t"][::std::mem::size_of::<x264_param_t>() - 1024usize];
    ["Alignment of x264_param_t"][::std::mem::align_of::<x264_param_t>() - 8usize];
    ["Offset of field: x264_param_t::cpu"][::std::mem::offset_of!(x264_param_t, cpu) - 0usize];
    ["Offset of field: x264_param_t::i_threads"]
        [::std::mem::offset_of!(x264_param_t, i_threads) - 4usize];
    ["Offset of field: x264_param_t::i_lookahead_threads"]
        [::std::mem::offset_of!(x264_param_t, i_lookahead_threads) - 8usize];
    ["Offset of field: x264_param_t::b_sliced_threads"]
        [::std::mem::offset_of!(x264_param_t, b_sliced_threads) - 12usize];
    ["Offset of field: x264_param_t::b_deterministic"]
        [::std::mem::offset_of!(x264_param_t, b_deterministic) - 16usize];
    ["Offset of field: x264_param_t::b_cpu_independent"]
        [::std::mem::offset_of!(x264_param_t, b_cpu_independent) - 20usize];
    ["Offset of field: x264_param_t::i_sync_lookahead"]
        [::std::mem::offset_of!(x264_param_t, i_sync_lookahead) - 24usize];
    ["Offset of field: x264_param_t::i_width"]
        [::std::mem::offset_of!(x264_param_t, i_width) - 28usize];
    ["Offset of field: x264_param_t::i_height"]
        [::std::mem::offset_of!(x264_param_t, i_height) - 32usize];
    ["Offset of field: x264_param_t::i_csp"][::std::mem::offset_of!(x264_param_t, i_csp) - 36usize];
    ["Offset of field: x264_param_t::i_bitdepth"]
        [::std::mem::offset_of!(x264_param_t, i_bitdepth) - 40usize];
    ["Offset of field: x264_param_t::i_level_idc"]
        [::std::mem::offset_of!(x264_param_t, i_level_idc) - 44usize];
    ["Offset of field: x264_param_t::i_frame_total"]
        [::std::mem::offset_of!(x264_param_t, i_frame_total) - 48usize];
    ["Offset of field: x264_param_t::i_nal_hrd"]
        [::std::mem::offset_of!(x264_param_t, i_nal_hrd) - 52usize];
    ["Offset of field: x264_param_t::vui"][::std::mem::offset_of!(x264_param_t, vui) - 56usize];
    ["Offset of field: x264_param_t::i_frame_reference"]
        [::std::mem::offset_of!(x264_param_t, i_frame_reference) - 92usize];
    ["Offset of field: x264_param_t::i_dpb_size"]
        [::std::mem::offset_of!(x264_param_t, i_dpb_size) - 96usize];
    ["Offset of field: x264_param_t::i_keyint_max"]
        [::std::mem::offset_of!(x264_param_t, i_keyint_max) - 100usize];
    ["Offset of field: x264_param_t::i_keyint_min"]
        [::std::mem::offset_of!(x264_param_t, i_keyint_min) - 104usize];
    ["Offset of field: x264_param_t::i_scenecut_threshold"]
        [::std::mem::offset_of!(x264_param_t, i_scenecut_threshold) - 108usize];
    ["Offset of field: x264_param_t::b_intra_refresh"]
        [::std::mem::offset_of!(x264_param_t, b_intra_refresh) - 112usize];
    ["Offset of field: x264_param_t::i_bframe"]
        [::std::mem::offset_of!(x264_param_t, i_bframe) - 116usize];
    ["Offset of field: x264_param_t::i_bframe_adaptive"]
        [::std::mem::offset_of!(x264_param_t, i_bframe_adaptive) - 120usize];
    ["Offset of field: x264_param_t::i_bframe_bias"]
        [::std::mem::offset_of!(x264_param_t, i_bframe_bias) - 124usize];
    ["Offset of field: x264_param_t::i_bframe_pyramid"]
        [::std::mem::offset_of!(x264_param_t, i_bframe_pyramid) - 128usize];
    ["Offset of field: x264_param_t::b_open_gop"]
        [::std::mem::offset_of!(x264_param_t, b_open_gop) - 132usize];
    ["Offset of field: x264_param_t::b_bluray_compat"]
        [::std::mem::offset_of!(x264_param_t, b_bluray_compat) - 136usize];
    ["Offset of field: x264_param_t::i_avcintra_class"]
        [::std::mem::offset_of!(x264_param_t, i_avcintra_class) - 140usize];
    ["Offset of field: x264_param_t::i_avcintra_flavor"]
        [::std::mem::offset_of!(x264_param_t, i_avcintra_flavor) - 144usize];
    ["Offset of field: x264_param_t::b_deblocking_filter"]
        [::std::mem::offset_of!(x264_param_t, b_deblocking_filter) - 148usize];
    ["Offset of field: x264_param_t::i_deblocking_filter_alphac0"]
        [::std::mem::offset_of!(x264_param_t, i_deblocking_filter_alphac0) - 152usize];
    ["Offset of field: x264_param_t::i_deblocking_filter_beta"]
        [::std::mem::offset_of!(x264_param_t, i_deblocking_filter_beta) - 156usize];
    ["Offset of field: x264_param_t::b_cabac"]
        [::std::mem::offset_of!(x264_param_t, b_cabac) - 160usize];
    ["Offset of field: x264_param_t::i_cabac_init_idc"]
        [::std::mem::offset_of!(x264_param_t, i_cabac_init_idc) - 164usize];
    ["Offset of field: x264_param_t::b_interlaced"]
        [::std::mem::offset_of!(x264_param_t, b_interlaced) - 168usize];
    ["Offset of field: x264_param_t::b_constrained_intra"]
        [::std::mem::offset_of!(x264_param_t, b_constrained_intra) - 172usize];
    ["Offset of field: x264_param_t::i_cqm_preset"]
        [::std::mem::offset_of!(x264_param_t, i_cqm_preset) - 176usize];
    ["Offset of field: x264_param_t::psz_cqm_file"]
        [::std::mem::offset_of!(x264_param_t, psz_cqm_file) - 184usize];
    ["Offset of field: x264_param_t::cqm_4iy"]
        [::std::mem::offset_of!(x264_param_t, cqm_4iy) - 192usize];
    ["Offset of field: x264_param_t::cqm_4py"]
        [::std::mem::offset_of!(x264_param_t, cqm_4py) - 208usize];
    ["Offset of field: x264_param_t::cqm_4ic"]
        [::std::mem::offset_of!(x264_param_t, cqm_4ic) - 224usize];
    ["Offset of field: x264_param_t::cqm_4pc"]
        [::std::mem::offset_of!(x264_param_t, cqm_4pc) - 240usize];
    ["Offset of field: x264_param_t::cqm_8iy"]
        [::std::mem::offset_of!(x264_param_t, cqm_8iy) - 256usize];
    ["Offset of field: x264_param_t::cqm_8py"]
        [::std::mem::offset_of!(x264_param_t, cqm_8py) - 320usize];
    ["Offset of field: x264_param_t::cqm_8ic"]
        [::std::mem::offset_of!(x264_param_t, cqm_8ic) - 384usize];
    ["Offset of field: x264_param_t::cqm_8pc"]
        [::std::mem::offset_of!(x264_param_t, cqm_8pc) - 448usize];
    ["Offset of field: x264_param_t::pf_log"]
        [::std::mem::offset_of!(x264_param_t, pf_log) - 512usize];
    ["Offset of field: x264_param_t::p_log_private"]
        [::std::mem::offset_of!(x264_param_t, p_log_private) - 520usize];
    ["Offset of field: x264_param_t::i_log_level"]
        [::std::mem::offset_of!(x264_param_t, i_log_level) - 528usize];
    ["Offset of field: x264_param_t::b_full_recon"]
        [::std::mem::offset_of!(x264_param_t, b_full_recon) - 532usize];
    ["Offset of field: x264_param_t::psz_dump_yuv"]
        [::std::mem::offset_of!(x264_param_t, psz_dump_yuv) - 536usize];
    ["Offset of field: x264_param_t::analyse"]
        [::std::mem::offset_of!(x264_param_t, analyse) - 544usize];
    ["Offset of field: x264_param_t::rc"][::std::mem::offset_of!(x264_param_t, rc) - 656usize];
    ["Offset of field: x264_param_t::crop_rect"]
        [::std::mem::offset_of!(x264_param_t, crop_rect) - 800usize];
    ["Offset of field: x264_param_t::i_frame_packing"]
        [::std::mem::offset_of!(x264_param_t, i_frame_packing) - 816usize];
    ["Offset of field: x264_param_t::mastering_display"]
        [::std::mem::offset_of!(x264_param_t, mastering_display) - 824usize];
    ["Offset of field: x264_param_t::content_light_level"]
        [::std::mem::offset_of!(x264_param_t, content_light_level) - 880usize];
    ["Offset of field: x264_param_t::i_alternative_transfer"]
        [::std::mem::offset_of!(x264_param_t, i_alternative_transfer) - 892usize];
    ["Offset of field: x264_param_t::b_aud"]
        [::std::mem::offset_of!(x264_param_t, b_aud) - 896usize];
    ["Offset of field: x264_param_t::b_repeat_headers"]
        [::std::mem::offset_of!(x264_param_t, b_repeat_headers) - 900usize];
    ["Offset of field: x264_param_t::b_annexb"]
        [::std::mem::offset_of!(x264_param_t, b_annexb) - 904usize];
    ["Offset of field: x264_param_t::i_sps_id"]
        [::std::mem::offset_of!(x264_param_t, i_sps_id) - 908usize];
    ["Offset of field: x264_param_t::b_vfr_input"]
        [::std::mem::offset_of!(x264_param_t, b_vfr_input) - 912usize];
    ["Offset of field: x264_param_t::b_pulldown"]
        [::std::mem::offset_of!(x264_param_t, b_pulldown) - 916usize];
    ["Offset of field: x264_param_t::i_fps_num"]
        [::std::mem::offset_of!(x264_param_t, i_fps_num) - 920usize];
    ["Offset of field: x264_param_t::i_fps_den"]
        [::std::mem::offset_of!(x264_param_t, i_fps_den) - 924usize];
    ["Offset of field: x264_param_t::i_timebase_num"]
        [::std::mem::offset_of!(x264_param_t, i_timebase_num) - 928usize];
    ["Offset of field: x264_param_t::i_timebase_den"]
        [::std::mem::offset_of!(x264_param_t, i_timebase_den) - 932usize];
    ["Offset of field: x264_param_t::b_tff"]
        [::std::mem::offset_of!(x264_param_t, b_tff) - 936usize];
    ["Offset of field: x264_param_t::b_pic_struct"]
        [::std::mem::offset_of!(x264_param_t, b_pic_struct) - 940usize];
    ["Offset of field: x264_param_t::b_fake_interlaced"]
        [::std::mem::offset_of!(x264_param_t, b_fake_interlaced) - 944usize];
    ["Offset of field: x264_param_t::b_stitchable"]
        [::std::mem::offset_of!(x264_param_t, b_stitchable) - 948usize];
    ["Offset of field: x264_param_t::b_opencl"]
        [::std::mem::offset_of!(x264_param_t, b_opencl) - 952usize];
    ["Offset of field: x264_param_t::i_opencl_device"]
        [::std::mem::offset_of!(x264_param_t, i_opencl_device) - 956usize];
    ["Offset of field: x264_param_t::opencl_device_id"]
        [::std::mem::offset_of!(x264_param_t, opencl_device_id) - 960usize];
    ["Offset of field: x264_param_t::psz_clbin_file"]
        [::std::mem::offset_of!(x264_param_t, psz_clbin_file) - 968usize];
    ["Offset of field: x264_param_t::i_slice_max_size"]
        [::std::mem::offset_of!(x264_param_t, i_slice_max_size) - 976usize];
    ["Offset of field: x264_param_t::i_slice_max_mbs"]
        [::std::mem::offset_of!(x264_param_t, i_slice_max_mbs) - 980usize];
    ["Offset of field: x264_param_t::i_slice_min_mbs"]
        [::std::mem::offset_of!(x264_param_t, i_slice_min_mbs) - 984usize];
    ["Offset of field: x264_param_t::i_slice_count"]
        [::std::mem::offset_of!(x264_param_t, i_slice_count) - 988usize];
    ["Offset of field: x264_param_t::i_slice_count_max"]
        [::std::mem::offset_of!(x264_param_t, i_slice_count_max) - 992usize];
    ["Offset of field: x264_param_t::param_free"]
        [::std::mem::offset_of!(x264_param_t, param_free) - 1000usize];
    ["Offset of field: x264_param_t::nalu_process"]
        [::std::mem::offset_of!(x264_param_t, nalu_process) - 1008usize];
    ["Offset of field: x264_param_t::opaque"]
        [::std::mem::offset_of!(x264_param_t, opaque) - 1016usize];
};
unsafe extern "C" {
    pub fn x264_nal_encode(h: *mut x264_t, dst: *mut u8, nal: *mut x264_nal_t);
}
#[doc = " H.264 level restriction information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_level_t {
    pub level_idc: u8,
    pub mbps: i32,
    pub frame_size: i32,
    pub dpb: i32,
    pub bitrate: i32,
    pub cpb: i32,
    pub mv_range: u16,
    pub mvs_per_2mb: u8,
    pub slice_rate: u8,
    pub mincr: u8,
    pub bipred8x8: u8,
    pub direct8x8: u8,
    pub frame_only: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_level_t"][::std::mem::size_of::<x264_level_t>() - 32usize];
    ["Alignment of x264_level_t"][::std::mem::align_of::<x264_level_t>() - 4usize];
    ["Offset of field: x264_level_t::level_idc"]
        [::std::mem::offset_of!(x264_level_t, level_idc) - 0usize];
    ["Offset of field: x264_level_t::mbps"][::std::mem::offset_of!(x264_level_t, mbps) - 4usize];
    ["Offset of field: x264_level_t::frame_size"]
        [::std::mem::offset_of!(x264_level_t, frame_size) - 8usize];
    ["Offset of field: x264_level_t::dpb"][::std::mem::offset_of!(x264_level_t, dpb) - 12usize];
    ["Offset of field: x264_level_t::bitrate"]
        [::std::mem::offset_of!(x264_level_t, bitrate) - 16usize];
    ["Offset of field: x264_level_t::cpb"][::std::mem::offset_of!(x264_level_t, cpb) - 20usize];
    ["Offset of field: x264_level_t::mv_range"]
        [::std::mem::offset_of!(x264_level_t, mv_range) - 24usize];
    ["Offset of field: x264_level_t::mvs_per_2mb"]
        [::std::mem::offset_of!(x264_level_t, mvs_per_2mb) - 26usize];
    ["Offset of field: x264_level_t::slice_rate"]
        [::std::mem::offset_of!(x264_level_t, slice_rate) - 27usize];
    ["Offset of field: x264_level_t::mincr"][::std::mem::offset_of!(x264_level_t, mincr) - 28usize];
    ["Offset of field: x264_level_t::bipred8x8"]
        [::std::mem::offset_of!(x264_level_t, bipred8x8) - 29usize];
    ["Offset of field: x264_level_t::direct8x8"]
        [::std::mem::offset_of!(x264_level_t, direct8x8) - 30usize];
    ["Offset of field: x264_level_t::frame_only"]
        [::std::mem::offset_of!(x264_level_t, frame_only) - 31usize];
};
unsafe extern "C" {
    pub static x264_levels: [x264_level_t; 0usize];
}
unsafe extern "C" {
    #[doc = " Basic parameter handling functions"]
    pub fn x264_param_default(arg1: *mut x264_param_t);
}
unsafe extern "C" {
    pub fn x264_param_parse(
        arg1: *mut x264_param_t,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn x264_param_cleanup(param: *mut x264_param_t);
}
unsafe extern "C" {
    #[doc = " Advanced parameter handling functions"]
    pub static x264_preset_names: [*const ::std::os::raw::c_char; 11usize];
}
unsafe extern "C" {
    pub static x264_tune_names: [*const ::std::os::raw::c_char; 9usize];
}
unsafe extern "C" {
    pub fn x264_param_default_preset(
        arg1: *mut x264_param_t,
        preset: *const ::std::os::raw::c_char,
        tune: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn x264_param_apply_fastfirstpass(arg1: *mut x264_param_t);
}
unsafe extern "C" {
    pub static x264_profile_names: [*const ::std::os::raw::c_char; 7usize];
}
unsafe extern "C" {
    pub fn x264_param_apply_profile(
        arg1: *mut x264_param_t,
        profile: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Picture structures and functions"]
    pub static x264_chroma_format: ::std::os::raw::c_int;
}
pub const pic_struct_e_PIC_STRUCT_AUTO: pic_struct_e = 0;
pub const pic_struct_e_PIC_STRUCT_PROGRESSIVE: pic_struct_e = 1;
pub const pic_struct_e_PIC_STRUCT_TOP_BOTTOM: pic_struct_e = 4;
pub const pic_struct_e_PIC_STRUCT_BOTTOM_TOP: pic_struct_e = 5;
pub const pic_struct_e_PIC_STRUCT_TOP_BOTTOM_TOP: pic_struct_e = 6;
pub const pic_struct_e_PIC_STRUCT_BOTTOM_TOP_BOTTOM: pic_struct_e = 7;
pub const pic_struct_e_PIC_STRUCT_DOUBLE: pic_struct_e = 8;
pub const pic_struct_e_PIC_STRUCT_TRIPLE: pic_struct_e = 9;
pub type pic_struct_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_hrd_t {
    pub cpb_initial_arrival_time: f64,
    pub cpb_final_arrival_time: f64,
    pub cpb_removal_time: f64,
    pub dpb_output_time: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_hrd_t"][::std::mem::size_of::<x264_hrd_t>() - 32usize];
    ["Alignment of x264_hrd_t"][::std::mem::align_of::<x264_hrd_t>() - 8usize];
    ["Offset of field: x264_hrd_t::cpb_initial_arrival_time"]
        [::std::mem::offset_of!(x264_hrd_t, cpb_initial_arrival_time) - 0usize];
    ["Offset of field: x264_hrd_t::cpb_final_arrival_time"]
        [::std::mem::offset_of!(x264_hrd_t, cpb_final_arrival_time) - 8usize];
    ["Offset of field: x264_hrd_t::cpb_removal_time"]
        [::std::mem::offset_of!(x264_hrd_t, cpb_removal_time) - 16usize];
    ["Offset of field: x264_hrd_t::dpb_output_time"]
        [::std::mem::offset_of!(x264_hrd_t, dpb_output_time) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_sei_payload_t {
    pub payload_size: ::std::os::raw::c_int,
    pub payload_type: ::std::os::raw::c_int,
    pub payload: *mut u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_sei_payload_t"][::std::mem::size_of::<x264_sei_payload_t>() - 16usize];
    ["Alignment of x264_sei_payload_t"][::std::mem::align_of::<x264_sei_payload_t>() - 8usize];
    ["Offset of field: x264_sei_payload_t::payload_size"]
        [::std::mem::offset_of!(x264_sei_payload_t, payload_size) - 0usize];
    ["Offset of field: x264_sei_payload_t::payload_type"]
        [::std::mem::offset_of!(x264_sei_payload_t, payload_type) - 4usize];
    ["Offset of field: x264_sei_payload_t::payload"]
        [::std::mem::offset_of!(x264_sei_payload_t, payload) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_sei_t {
    pub num_payloads: ::std::os::raw::c_int,
    pub payloads: *mut x264_sei_payload_t,
    pub sei_free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_sei_t"][::std::mem::size_of::<x264_sei_t>() - 24usize];
    ["Alignment of x264_sei_t"][::std::mem::align_of::<x264_sei_t>() - 8usize];
    ["Offset of field: x264_sei_t::num_payloads"]
        [::std::mem::offset_of!(x264_sei_t, num_payloads) - 0usize];
    ["Offset of field: x264_sei_t::payloads"]
        [::std::mem::offset_of!(x264_sei_t, payloads) - 8usize];
    ["Offset of field: x264_sei_t::sei_free"]
        [::std::mem::offset_of!(x264_sei_t, sei_free) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_image_t {
    pub i_csp: ::std::os::raw::c_int,
    pub i_plane: ::std::os::raw::c_int,
    pub i_stride: [::std::os::raw::c_int; 4usize],
    pub plane: [*mut u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_image_t"][::std::mem::size_of::<x264_image_t>() - 56usize];
    ["Alignment of x264_image_t"][::std::mem::align_of::<x264_image_t>() - 8usize];
    ["Offset of field: x264_image_t::i_csp"][::std::mem::offset_of!(x264_image_t, i_csp) - 0usize];
    ["Offset of field: x264_image_t::i_plane"]
        [::std::mem::offset_of!(x264_image_t, i_plane) - 4usize];
    ["Offset of field: x264_image_t::i_stride"]
        [::std::mem::offset_of!(x264_image_t, i_stride) - 8usize];
    ["Offset of field: x264_image_t::plane"][::std::mem::offset_of!(x264_image_t, plane) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_image_properties_t {
    pub quant_offsets: *mut f32,
    pub quant_offsets_free:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub mb_info: *mut u8,
    pub mb_info_free:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub f_ssim: f64,
    pub f_psnr_avg: f64,
    pub f_psnr: [f64; 3usize],
    pub f_crf_avg: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_image_properties_t"][::std::mem::size_of::<x264_image_properties_t>() - 80usize];
    ["Alignment of x264_image_properties_t"]
        [::std::mem::align_of::<x264_image_properties_t>() - 8usize];
    ["Offset of field: x264_image_properties_t::quant_offsets"]
        [::std::mem::offset_of!(x264_image_properties_t, quant_offsets) - 0usize];
    ["Offset of field: x264_image_properties_t::quant_offsets_free"]
        [::std::mem::offset_of!(x264_image_properties_t, quant_offsets_free) - 8usize];
    ["Offset of field: x264_image_properties_t::mb_info"]
        [::std::mem::offset_of!(x264_image_properties_t, mb_info) - 16usize];
    ["Offset of field: x264_image_properties_t::mb_info_free"]
        [::std::mem::offset_of!(x264_image_properties_t, mb_info_free) - 24usize];
    ["Offset of field: x264_image_properties_t::f_ssim"]
        [::std::mem::offset_of!(x264_image_properties_t, f_ssim) - 32usize];
    ["Offset of field: x264_image_properties_t::f_psnr_avg"]
        [::std::mem::offset_of!(x264_image_properties_t, f_psnr_avg) - 40usize];
    ["Offset of field: x264_image_properties_t::f_psnr"]
        [::std::mem::offset_of!(x264_image_properties_t, f_psnr) - 48usize];
    ["Offset of field: x264_image_properties_t::f_crf_avg"]
        [::std::mem::offset_of!(x264_image_properties_t, f_crf_avg) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x264_picture_t {
    pub i_type: ::std::os::raw::c_int,
    pub i_qpplus1: ::std::os::raw::c_int,
    pub i_pic_struct: ::std::os::raw::c_int,
    pub b_keyframe: ::std::os::raw::c_int,
    pub i_pts: i64,
    pub i_dts: i64,
    pub param: *mut x264_param_t,
    pub img: x264_image_t,
    pub prop: x264_image_properties_t,
    pub hrd_timing: x264_hrd_t,
    pub extra_sei: x264_sei_t,
    pub opaque: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of x264_picture_t"][::std::mem::size_of::<x264_picture_t>() - 240usize];
    ["Alignment of x264_picture_t"][::std::mem::align_of::<x264_picture_t>() - 8usize];
    ["Offset of field: x264_picture_t::i_type"]
        [::std::mem::offset_of!(x264_picture_t, i_type) - 0usize];
    ["Offset of field: x264_picture_t::i_qpplus1"]
        [::std::mem::offset_of!(x264_picture_t, i_qpplus1) - 4usize];
    ["Offset of field: x264_picture_t::i_pic_struct"]
        [::std::mem::offset_of!(x264_picture_t, i_pic_struct) - 8usize];
    ["Offset of field: x264_picture_t::b_keyframe"]
        [::std::mem::offset_of!(x264_picture_t, b_keyframe) - 12usize];
    ["Offset of field: x264_picture_t::i_pts"]
        [::std::mem::offset_of!(x264_picture_t, i_pts) - 16usize];
    ["Offset of field: x264_picture_t::i_dts"]
        [::std::mem::offset_of!(x264_picture_t, i_dts) - 24usize];
    ["Offset of field: x264_picture_t::param"]
        [::std::mem::offset_of!(x264_picture_t, param) - 32usize];
    ["Offset of field: x264_picture_t::img"][::std::mem::offset_of!(x264_picture_t, img) - 40usize];
    ["Offset of field: x264_picture_t::prop"]
        [::std::mem::offset_of!(x264_picture_t, prop) - 96usize];
    ["Offset of field: x264_picture_t::hrd_timing"]
        [::std::mem::offset_of!(x264_picture_t, hrd_timing) - 176usize];
    ["Offset of field: x264_picture_t::extra_sei"]
        [::std::mem::offset_of!(x264_picture_t, extra_sei) - 208usize];
    ["Offset of field: x264_picture_t::opaque"]
        [::std::mem::offset_of!(x264_picture_t, opaque) - 232usize];
};
unsafe extern "C" {
    pub fn x264_picture_init(pic: *mut x264_picture_t);
}
unsafe extern "C" {
    pub fn x264_picture_alloc(
        pic: *mut x264_picture_t,
        i_csp: ::std::os::raw::c_int,
        i_width: ::std::os::raw::c_int,
        i_height: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn x264_picture_clean(pic: *mut x264_picture_t);
}
unsafe extern "C" {
    pub fn x264_encoder_open_164(arg1: *mut x264_param_t) -> *mut x264_t;
}
unsafe extern "C" {
    pub fn x264_encoder_reconfig(
        arg1: *mut x264_t,
        arg2: *mut x264_param_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn x264_encoder_parameters(arg1: *mut x264_t, arg2: *mut x264_param_t);
}
unsafe extern "C" {
    pub fn x264_encoder_headers(
        arg1: *mut x264_t,
        pp_nal: *mut *mut x264_nal_t,
        pi_nal: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn x264_encoder_encode(
        arg1: *mut x264_t,
        pp_nal: *mut *mut x264_nal_t,
        pi_nal: *mut ::std::os::raw::c_int,
        pic_in: *mut x264_picture_t,
        pic_out: *mut x264_picture_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn x264_encoder_close(arg1: *mut x264_t);
}
unsafe extern "C" {
    pub fn x264_encoder_delayed_frames(arg1: *mut x264_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn x264_encoder_maximum_delayed_frames(arg1: *mut x264_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn x264_encoder_intra_refresh(arg1: *mut x264_t);
}
unsafe extern "C" {
    pub fn x264_encoder_invalidate_reference(arg1: *mut x264_t, pts: i64) -> ::std::os::raw::c_int;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
